#include <string>
#include <vector>
#include "map.hpp"
using namespace std;



void Init_Map(Map &map){
    // 線の種類
    const vector<char> LineColors = {'M', 'Y', 'S', 'N', 'P', 'T', 'C', 'K', 'I'};

    // その線における最小番号と最大番号(本家に準拠)
    // (ex)御堂筋線: min=6, max=30
    const vector<pair<int, int>> Line_Min_Max = {
        {6,  30},   // 御堂筋線
        {11, 21},   // 四つ橋線
        {11, 24},   // 千日前線
        {11, 27},   // 長堀鶴見緑地線
        {9,  18},   // ニュートラム
        {11, 36},   // 谷町線
        {9,  23},   // 中央線
        {1,  20},   // 堺筋線
        {11, 21}    // 今里ライナー
    };

    //駅名の集合
    const vector<vector<string>> StationNames = {
        //御堂筋線
        {"箕面萱野", "箕面船場阪大前", "千里中央", "桃山台", "緑地公園", "江坂", "東三国",
		"新大阪", "西中島南方", "中津", "梅田", "淀屋橋", "本町", "心斎橋", "なんば",
		"大国町", "動物園前", "天王寺", "昭和町", "西田辺", "長居", "あびこ",
		"北花田", "新金岡", "なかもず" },
        //四つ橋線
		{"梅田", "肥後橋", "本町", "心斎橋", "なんば", "大国町", "花園町",
		"岸里", "玉出", "北加賀屋", "住之江公園"},
        //千日前線
		{"野田阪神", "玉川", "阿波座", "西長堀", "桜川", "なんば", "日本橋",
		"谷町九丁目", "鶴橋", "今里", "新深江", "小路", "北巽", "南巽"},
        //長堀鶴見緑地線
		{"大正", "ドーム前千代崎", "西長堀", "西大橋", "心斎橋", "長堀橋",
		"松屋町", "谷町六丁目", "玉造", "森ノ宮", "大阪ビジネスパーク", "京橋",
		"蒲生四丁目", "今福鶴見", "横堤", "鶴見緑地", "門真南"},
        //ニュートラム
		{"コスモスクエア", "トレードセンター前", "中ふ頭", "ポートタウン西",
		"ポートタウン東", "フェリーターミナル", "南港東", "南港口", "平林",
		"住之江公園"},
        //谷町線
		{"大日", "守口", "太子橋今市", "千林大宮", "関目高殿", "野江内代", "都島",
		"天神橋筋六丁目", "中崎町", "梅田", "南森町", "天満橋", "谷町四丁目",
		"谷町六丁目", "谷町九丁目", "四天王寺前夕陽ヶ丘", "天王寺", "阿倍野",
		"文の里", "田辺", "駒川中野", "平野", "喜連瓜破", "出戸", "長原", "八尾南"},
        //中央線
		{"コスモスクエア", "大阪港", "朝潮橋", "弁天町", "九条", "阿波座", "本町",
		"堺筋本町", "谷町四丁目", "森ノ宮", "緑橋", "深江橋", "高井田", "長田",
		"荒本", "吉田", "新石切", "生駒", "白庭台", "学研北生駒", "学研奈良登美ヶ丘"},
        //堺筋線
		{"北千里", "山田", "南千里", "千里山", "関大前", "豊津", "吹田", "下新庄",
		"淡路", "柴島","天神橋筋六丁目", "扇町", "南森町", "北浜", "堺筋本町", "長堀橋",
        "日本橋", "恵美須町", "動物園前","天下茶屋"},
        //今里ライナー
		{"井高野", "瑞光四丁目", "だいどう豊里", "太子橋今市","清水","新古森市",
        "関目成育", "蒲生四丁目", "鴫野", "緑橋", "今里"}
    };

    for(int line = 0; line < Num_LineColor; ++line){
        int start = Line_Min_Max[line].first;

         for (int j = 0; j < StationNames[line].size(); ++j) {
            int stationNo = start + j;
            Station& s = map[line][stationNo];

            s.StationName = StationNames[line][j];
            s.LineColor.push_back(LineColors[line]);
            s.StationNumber.push_back(stationNo);
        }
    }
}